app/controllers/gifts_controller.rb

SELECT `gifts`.* FROM `gifts`
---
  def index
    @gifts = Gift.all